app/controllers/characters_controller.rb

  def create
    @character = Character.new(character_params)
    if @character.save
---
INSERT INTO "characters" ("player_name", "name", "background", "character_class", "alignment", "ideals", "personality_traits", "bonds", "flaws", "race", "eyes", "hair", "skin", "backstory", "created_at", "updated_at", "weight", "age") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"

  def edit
    @character = Character.find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def update
    @character = Character.find(params[:id])
    @character.update(character_params)
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "characters" SET "player_name" = ?, "updated_at" = ? WHERE "characters"."id" = ?  [["player_name", "Tony2"], ["updated_at", "2020-04-23 02:42:31.552830"], ["id", 10]]

  def destroy
    @character = Character.find(params[:id])
    @character.destroy
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 1]]